Res-social/Res-firecracker-random-v1/firecracker_t_4_c_6_composePosts_composeVcpu_6_wrkVcpu_1/wrk.txt
Running 1m test @ http://nginx-thrift:8080/wrk2-api/post/compose
  4 threads and 6 connections
  Thread calibration: mean lat.: 2594.449ms, rate sampling interval: 6692ms
  Thread calibration: mean lat.: 2786.191ms, rate sampling interval: 7114ms
  Thread calibration: mean lat.: 2670.110ms, rate sampling interval: 6709ms
  Thread calibration: mean lat.: 2712.834ms, rate sampling interval: 6856ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.43s   251.76ms   4.07s    66.56%
    Req/Sec   170.89      1.74   174.00     85.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.41s 
 75.000%    3.60s 
 90.000%    3.77s 
 99.000%    4.07s 
 99.900%    4.19s 
 99.990%    4.30s 
 99.999%    4.31s 
100.000%    4.31s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2756.607     0.000000            1         1.00
    3112.959     0.100000         3451         1.11
    3205.119     0.200000         6869         1.25
    3278.847     0.300000        10343         1.43
    3346.431     0.400000        13783         1.67
    3414.015     0.500000        17195         2.00
    3450.879     0.550000        18905         2.22
    3485.695     0.600000        20582         2.50
    3524.607     0.650000        22372         2.86
    3563.519     0.700000        24054         3.33
    3604.479     0.750000        25778         4.00
    3624.959     0.775000        26581         4.44
    3647.487     0.800000        27432         5.00
    3672.063     0.825000        28298         5.71
    3700.735     0.850000        29188         6.67
    3733.503     0.875000        30047         8.00
    3749.887     0.887500        30436         8.89
    3770.367     0.900000        30891        10.00
    3792.895     0.912500        31303        11.43
    3815.423     0.925000        31740        13.33
    3842.047     0.937500        32168        16.00
    3856.383     0.943750        32387        17.78
    3870.719     0.950000        32595        20.00
    3887.103     0.956250        32796        22.86
    3905.535     0.962500        33007        26.67
    3928.063     0.968750        33238        32.00
    3940.351     0.971875        33334        35.56
    3954.687     0.975000        33434        40.00
    3975.167     0.978125        33541        45.71
    3995.647     0.981250        33652        53.33
    4020.223     0.984375        33760        64.00
    4030.463     0.985938        33809        71.11
    4044.799     0.987500        33863        80.00
    4057.087     0.989062        33915        91.43
    4073.471     0.990625        33970       106.67
    4087.807     0.992188        34023       128.00
    4095.999     0.992969        34052       142.22
    4106.239     0.993750        34079       160.00
    4116.479     0.994531        34108       182.86
    4126.719     0.995313        34136       213.33
    4136.959     0.996094        34161       256.00
    4141.055     0.996484        34171       284.44
    4147.199     0.996875        34183       320.00
    4155.391     0.997266        34204       365.71
    4159.487     0.997656        34214       426.67
    4167.679     0.998047        34224       512.00
    4173.823     0.998242        34232       568.89
    4179.967     0.998437        34239       640.00
    4184.063     0.998633        34244       731.43
    4190.207     0.998828        34252       853.33
    4198.399     0.999023        34258      1024.00
    4202.495     0.999121        34262      1137.78
    4206.591     0.999219        34265      1280.00
    4210.687     0.999316        34268      1462.86
    4214.783     0.999414        34270      1706.67
    4222.975     0.999512        34274      2048.00
    4227.071     0.999561        34276      2275.56
    4231.167     0.999609        34277      2560.00
    4247.551     0.999658        34279      2925.71
    4251.647     0.999707        34280      3413.33
    4263.935     0.999756        34282      4096.00
    4272.127     0.999780        34283      4551.11
    4276.223     0.999805        34284      5120.00
    4284.415     0.999829        34285      5851.43
    4284.415     0.999854        34285      6826.67
    4292.607     0.999878        34286      8192.00
    4296.703     0.999890        34287      9102.22
    4296.703     0.999902        34287     10240.00
    4308.991     0.999915        34289     11702.86
    4308.991     0.999927        34289     13653.33
    4308.991     0.999939        34289     16384.00
    4308.991     0.999945        34289     18204.44
    4308.991     0.999951        34289     20480.00
    4308.991     0.999957        34289     23405.71
    4308.991     0.999963        34289     27306.67
    4308.991     0.999969        34289     32768.00
    4313.087     0.999973        34290     36408.89
    4313.087     1.000000        34290          inf
#[Mean    =     3430.582, StdDeviation   =      251.757]
#[Max     =     4308.992, Total count    =        34290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  41042 requests in 1.00m, 8.42MB read
Requests/sec:    684.02
Transfer/sec:    143.62KB